BrianLChen/nRF52840-2.4GKeyboard/Keyboard_Body/src/main.c
/*
 * Copyright (c) 2024 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <sample_usbd.h>

#include <string.h>

#include <zephyr/device.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/kernel.h>
#include <zephyr/sys/util.h>

#include <zephyr/usb/class/usbd_hid.h>
#include <zephyr/usb/usbd.h>

#include <gzll_glue.h>
#include <nrf_gzll.h>

#include <debounce.h>
#include <hid_descriptor.h>
#include <kbd_define.h>
#include <key_state.h>
#include <keymap.h>
#include <keyscan_spi.h>
#include <knob.h>
#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(main, KBD_LOG_LEVEL);

enum kb_leds_idx
{
    /*
     * These indexes intentionally match the HID LED output report bit order:
     * bit0 NumLock, bit1 CapsLock, bit2 ScrollLock.
     */
    KB_LED_NUMLOCK = 0,
    KB_LED_CAPSLOCK,
    KB_LED_SCROLLLOCK,
    KB_LED_COUNT,
};

static const struct gpio_dt_spec kb_leds[KB_LED_COUNT] = {
    GPIO_DT_SPEC_GET_OR(DT_ALIAS(kbd_led_numlock), gpios, {0}),
    GPIO_DT_SPEC_GET_OR(DT_ALIAS(kbd_led_capslock), gpios, {0}),
    GPIO_DT_SPEC_GET_OR(DT_ALIAS(kbd_led_scrolllock), gpios, {0}),
};

enum keyboard_mode
{
    KEYBOARD_MODE_WIRED,
    KEYBOARD_MODE_BLE,
    KEYBOARD_MODE_WIRELESS_24G,
};

#define KBD_USER_NODE DT_PATH(zephyr_user)

static const struct gpio_dt_spec kbd_power =
    GPIO_DT_SPEC_GET(KBD_USER_NODE, kbd_power_gpios);

static const struct gpio_dt_spec mode_wire =
    GPIO_DT_SPEC_GET(KBD_USER_NODE, mode_wire_gpios);
static const struct gpio_dt_spec mode_ble =
    GPIO_DT_SPEC_GET(KBD_USER_NODE, mode_ble_gpios);
static const struct gpio_dt_spec mode_wireless =
    GPIO_DT_SPEC_GET(KBD_USER_NODE, mode_wireless_gpios);

/*
 * Gazell callbacks should stay small. They run from the radio/Gazell context,
 * so the callback only copies the TX result into a queue and wakes normal
 * Zephyr work to do RX FIFO reads and LED state updates.
 */
struct gzll_tx_result
{
    bool success;
    uint32_t pipe;
    nrf_gzll_device_tx_info_t info;
};

K_SEM_DEFINE(scan_sem, 0, 1);
K_MSGQ_DEFINE(gzll_tx_msgq, sizeof(struct gzll_tx_result), 2, sizeof(uint32_t));

UDC_STATIC_BUF_DEFINE(keyboard_report, KBD_HID_KEYBOARD_REPORT_BYTES);
UDC_STATIC_BUF_DEFINE(consumer_report, KBD_HID_CONSUMER_REPORT_BYTES);
static uint8_t keyboard_report_prev[KBD_HID_KEYBOARD_REPORT_BYTES];
static uint8_t consumer_report_prev[KBD_HID_CONSUMER_REPORT_BYTES];

/*
 * 2.4G TX payload is intentionally fixed at the full keyboard report length.
 * Smaller reports, such as consumer control, are zero padded before enqueueing
 * so the dongle can remain a transparent USB forwarder.
 */
static uint8_t wireless_payload[KBD_GZLL_TX_PAYLOAD_BYTES];

/*
 * ACK payload carries host-to-keyboard status. For now only byte 0 is used for
 * keyboard LED state returned by the dongle after the host updates Num/Caps/
 * Scroll Lock.
 */
static uint8_t wireless_ack_payload[NRF_GZLL_CONST_MAX_PAYLOAD_LENGTH];

/*
 * nrf_gzll_set_channel_table() takes a mutable pointer, so this table cannot
 * be const even though the project treats the configured channels as fixed.
 */
static uint8_t wireless_gzll_channel_table[KBD_GZLL_CHANNEL_COUNT] =
    KBD_GZLL_CHANNEL_TABLE;
static struct k_work gzll_work;
static uint32_t kb_duration;
static bool kb_ready;
static uint8_t wireless_disconnect_counter;
static uint32_t wireless_keep_alive_fail_counter_ms;
static uint8_t keyboard_led_state;

/*
 * Timer ISR only releases the scan loop. SPI scan, debounce, keymap, and USB/
 * Gazell report work stay in thread context.
 */
static void scan_timer_expiry(struct k_timer *timer)
{
    ARG_UNUSED(timer);

    k_sem_give(&scan_sem);
}

K_TIMER_DEFINE(scan_timer, scan_timer_expiry, NULL);

static void keyboard_report_init(void)
{
    /*
     * Reports keep their report ID in byte 0 permanently. Builders only clear
     * the payload bytes so report identity is never lost between submissions.
     */
    keyboard_report[0] = KBD_HID_REPORT_ID_KEYBOARD;
    consumer_report[0] = KBD_HID_REPORT_ID_CONSUMER;
    keyboard_report_prev[0] = KBD_HID_REPORT_ID_KEYBOARD;
    consumer_report_prev[0] = KBD_HID_REPORT_ID_CONSUMER;
}

/* All transports share the same active-low status LED GPIOs. */
static int keyboard_leds_init(void)
{
    for (unsigned int i = 0; i < ARRAY_SIZE(kb_leds); i++)
    {
        if (kb_leds[i].port == NULL)
        {
            continue;
        }
        if (!gpio_is_ready_dt(&kb_leds[i]))
        {
            LOG_ERR("LED device %s is not ready", kb_leds[i].port->name);
            return -ENODEV;
        }
        int ret = gpio_pin_configure_dt(&kb_leds[i], GPIO_OUTPUT_INACTIVE);
        if (ret != 0)
        {
            LOG_ERR("Failed to configure LED %u, %d", i, ret);
            return ret;
        }
    }
    return 0;
}

static void keyboard_leds_set_state(uint8_t led_state)
{
    /*
     * Missing LED aliases are allowed during board bring-up. A zeroed
     * gpio_dt_spec is skipped so the firmware can run before final LED pins
     * are assigned in devicetree.
     */
    for (unsigned int i = 0; i < ARRAY_SIZE(kb_leds); i++)
    {
        bool enabled = (led_state & BIT(i)) != 0U;

        if (kb_leds[i].port == NULL)
        {
            continue;
        }

        (void)gpio_pin_set_dt(&kb_leds[i], enabled ? 1 : 0);
    }
}

static void keyboard_leds_clear(void)
{
    keyboard_leds_set_state(0);
}

static int keyboard_leds_set_report(const uint8_t id, const uint16_t len,
                                    const uint8_t *const buf)
{
    if (len == 0U)
    {
        return 0;
    }

    if (id != 0U && id != KBD_HID_REPORT_ID_KEYBOARD)
    {
        LOG_WRN("Unsupported output report ID %u", id);
        return -ENOTSUP;
    }

    /*
     * Control endpoint SET_REPORT can arrive either as [led_state] or as
     * [report_id, led_state]. Accept both forms because different hosts and
     * Zephyr paths may expose the output report with or without the ID byte.
     */
    if (len > 1U && buf[0] == KBD_HID_REPORT_ID_KEYBOARD)
    {
        keyboard_led_state = buf[1];
    }
    else
    {
        keyboard_led_state = buf[0];
    }

