BrianLChen/nRF52840-2.4GKeyboard/Keyboard_Body/src/main.c
    keyboard_led_state &= BIT(KB_LED_NUMLOCK) |
                          BIT(KB_LED_CAPSLOCK) |
                          BIT(KB_LED_SCROLLLOCK);

    LOG_INF("Keyboard LED state: 0x%02x", keyboard_led_state);
    keyboard_leds_set_state(keyboard_led_state);

    return 0;
}

static void keyboard_report_set_code(uint16_t code)
{
    uint8_t byte_index;
    uint8_t mask;

    if (code == KBD_KEY_NONE)
    {
        return;
    }

    /*
     * Keymap codes are already encoded as report bit positions for keyboard
     * usages, while consumer controls are kept in a separate report.
     */
    if (code >= CONSUMER_VOLUME_INCREASE &&
        code <= CONSUMER_AL_CALCULATOR)
    {
        consumer_report[1] |= BIT(code - CONSUMER_VOLUME_INCREASE);
        return;
    }

    byte_index = code / 8U;
    if (byte_index >= KBD_HID_KEYBOARD_REPORT_BYTES)
    {
        LOG_WRN("Keymap code %u is outside keyboard report", code);
        return;
    }

    mask = BIT(code % 8U);
    keyboard_report[byte_index] |= mask;
}

static void keyboard_report_build_from_keymap(void)
{
    uint8_t active_layer = keymap_get_active_layer();
    struct key_state *keys = key_state_buffer_get();

    /*
     * FN keys select the active layer but do not emit a HID usage by
     * themselves. The active layer is computed from debounced key state.
     */
    memset(&keyboard_report[1], 0, KBD_HID_KEYBOARD_REPORT_BYTES - 1);
    consumer_report[1] = 0;

    for (uint16_t key = 0; key < KBD_KEY_COUNT; key++)
    {
        if (!keys[key].press_status || keymap_is_fn_key(key))
        {
            continue;
        }

        keyboard_report_set_code(keymap_get_code(active_layer, key));
    }
}

static bool keyboard_scan_once(void)
{
    int ret;

    LOG_DBG("Main thread: Scan");

    /*
     * keyscan_read() writes raw scan bits into key_state. debounce_update()
     * then converts those raw bits into stable press_status values.
     */
    ret = keyscan_read();
    if (ret != 0)
    {
        LOG_ERR("Matrix scan failed, %d", ret);
        return false;
    }

    if (debounce_update())
    {
        LOG_INF("Debounced key state changed");
        keyscan_log_changes();
        return true;
    }

    return false;
}

static void __maybe_unused wireless_disconnect_counter_reset(void)
{
    wireless_disconnect_counter = 0;
    wireless_keep_alive_fail_counter_ms = k_uptime_get_32();
}

static void __maybe_unused wireless_disconnect_counter_add_report_fail(void)
{
    if (wireless_disconnect_counter < KBD_WIRELESS_DISCONNECT_COUNTER_THRESHOLD)
    {
        wireless_disconnect_counter++;
    }

    if (wireless_disconnect_counter >= KBD_WIRELESS_DISCONNECT_COUNTER_THRESHOLD)
    {
        keyboard_leds_clear();
    }
}

/*
 * Keep-alive failures are rate-limited before touching the shared disconnect
 * counter. This prevents background keep-alive traffic from making the device
 * enter disconnected behavior faster than real failed key reports.
 */
static void __maybe_unused wireless_disconnect_counter_add_keep_alive_fail(void)
{
    uint32_t now = k_uptime_get_32();

    if ((now - wireless_keep_alive_fail_counter_ms) <
        KBD_WIRELESS_DISCONNECT_COUNTER_PERIOD_MS)
    {
        return;
    }

    wireless_keep_alive_fail_counter_ms = now;
    wireless_disconnect_counter_add_report_fail();
}

static void __maybe_unused wireless_sleep_prepare(void)
{
    keyboard_leds_clear();
}

/*
 * Queue one Gazell packet. The caller passes the logical HID report length;
 * this function pads it to KBD_GZLL_TX_PAYLOAD_BYTES for the radio payload.
 */
static int wireless_gzll_queue_payload(const uint8_t *report, size_t report_size)
{
    bool result_value;

    if (report_size > sizeof(wireless_payload))
    {
        LOG_ERR("Wireless report too large: %u", (unsigned int)report_size);
        return -EINVAL;
    }

    memset(wireless_payload, 0, sizeof(wireless_payload));
    memcpy(wireless_payload, report, report_size);

    result_value = nrf_gzll_add_packet_to_tx_fifo(KBD_GZLL_PIPE_NUMBER,
                                                  wireless_payload,
                                                  sizeof(wireless_payload));
    if (!result_value)
    {
        LOG_WRN("GZLL TX FIFO add failed");
        return -EIO;
    }

    return 0;
}

/*
 * Process one completed Gazell TX attempt in workqueue context.
 *
 * TX success is the connection signal because the host does not continuously
 * send LED output reports. If the ACK contains data, byte 0 is applied to the
 * local keyboard LED indicators.
 */
static void wireless_gzll_handle_tx_result(struct gzll_tx_result *tx_result)
{
    bool result_value;
    uint32_t ack_payload_length = sizeof(wireless_ack_payload);

    if (tx_result->success)
    {
        wireless_disconnect_counter_reset();

        if (tx_result->info.payload_received_in_ack)
        {
            result_value = nrf_gzll_fetch_packet_from_rx_fifo(
                tx_result->pipe,
                wireless_ack_payload,
                &ack_payload_length);
            if (!result_value)
            {
                LOG_ERR("GZLL RX FIFO fetch failed");
                return;
            }

            if (ack_payload_length >= KBD_GZLL_ACK_PAYLOAD_BYTES)
            {
                keyboard_led_state = wireless_ack_payload[0] &
                                     (BIT(KB_LED_NUMLOCK) |
                                      BIT(KB_LED_CAPSLOCK) |
                                      BIT(KB_LED_SCROLLLOCK));
                keyboard_leds_set_state(keyboard_led_state);
            }
        }

        return;
    }

    wireless_disconnect_counter_add_report_fail();
}

/* Drain all queued radio completion events after a callback wakes this work. */
static void wireless_gzll_work_handler(struct k_work *work)
{
    struct gzll_tx_result tx_result;

    ARG_UNUSED(work);

    while (k_msgq_get(&gzll_tx_msgq, &tx_result, K_NO_WAIT) == 0)
    {
        wireless_gzll_handle_tx_result(&tx_result);
    }
}

/* Common callback helper: copy Gazell TX metadata into Zephyr-owned context. */
static void wireless_gzll_report_tx(bool success,
                                    uint32_t pipe,
                                    nrf_gzll_device_tx_info_t *tx_info)
{
    struct gzll_tx_result tx_result = {
        .success = success,
        .pipe = pipe,
        .info = *tx_info,
    };

    if (k_msgq_put(&gzll_tx_msgq, &tx_result, K_NO_WAIT) == 0)
    {
        k_work_submit(&gzll_work);
    }
}

/* Gazell device callback: packet was ACKed by the dongle. */
void nrf_gzll_device_tx_success(uint32_t pipe, nrf_gzll_device_tx_info_t tx_info)
{
    wireless_gzll_report_tx(true, pipe, &tx_info);
}

/* Gazell device callback: packet retry budget expired without an ACK. */
void nrf_gzll_device_tx_failed(uint32_t pipe, nrf_gzll_device_tx_info_t tx_info)
{
    wireless_gzll_report_tx(false, pipe, &tx_info);
}

/* Required Gazell callback. No dynamic shutdown handling is needed yet. */
void nrf_gzll_disabled(void)
{
}

