BrianLChen/nRF52840-2.4GKeyboard/Keyboard_Body/src/main.c
/*
 * Host RX is not used by the keyboard body. The body is a Gazell device and
 * receives dongle data through ACK payloads after TX success.
 */
void nrf_gzll_host_rx_data_ready(uint32_t pipe, nrf_gzll_host_rx_info_t rx_info)
{
    ARG_UNUSED(pipe);
    ARG_UNUSED(rx_info);
}

/*
 * Configure the keyboard body as a Gazell device.
 *
 * Address, prefix, channel table, payload size, and ACK payload size must stay
 * aligned with the dongle side shared configuration.
 */
static int wireless_gzll_init(void)
{
    bool result_value;

    k_work_init(&gzll_work, wireless_gzll_work_handler);

    result_value = gzll_glue_init();
    if (!result_value)
    {
        LOG_ERR("Cannot initialize GZLL glue");
        return -EIO;
    }

    result_value = nrf_gzll_init(NRF_GZLL_MODE_DEVICE);
    if (!result_value)
    {
        LOG_ERR("Cannot initialize GZLL device");
        return -EIO;
    }

    result_value = nrf_gzll_set_base_address_1(KBD_GZLL_BASE_ADDRESS_1);
    if (!result_value)
    {
        LOG_ERR("Cannot set GZLL base address");
        return -EIO;
    }

    result_value = nrf_gzll_set_address_prefix_byte(KBD_GZLL_PIPE_NUMBER,
                                                    KBD_GZLL_PIPE_PREFIX);
    if (!result_value)
    {
        LOG_ERR("Cannot set GZLL pipe prefix");
        return -EIO;
    }

    result_value = nrf_gzll_set_channel_table(wireless_gzll_channel_table,
                                              KBD_GZLL_CHANNEL_COUNT);
    if (!result_value)
    {
        LOG_ERR("Cannot set GZLL channel table");
        return -EIO;
    }

    nrf_gzll_set_timeslots_per_channel(KBD_GZLL_TIMESLOTS_PER_CHANNEL);
    nrf_gzll_set_timeslots_per_channel_when_device_out_of_sync(
        KBD_GZLL_OUT_OF_SYNC_TIMESLOTS_PER_CHANNEL);
    nrf_gzll_set_device_channel_selection_policy(
        NRF_GZLL_DEVICE_CHANNEL_SELECTION_POLICY_USE_CURRENT);
    nrf_gzll_set_sync_lifetime(KBD_GZLL_SYNC_LIFETIME);
    nrf_gzll_set_max_tx_attempts(KBD_GZLL_MAX_TX_ATTEMPTS);

    /*
     * Prime the FIFO before enabling Gazell. This mirrors Nordic's example
     * flow and gives the radio an initial packet immediately after enable.
     */
    result_value = nrf_gzll_add_packet_to_tx_fifo(KBD_GZLL_PIPE_NUMBER,
                                                  keyboard_report,
                                                  KBD_GZLL_TX_PAYLOAD_BYTES);
    if (!result_value)
    {
        LOG_ERR("Cannot add initial GZLL TX packet");
        return -EIO;
    }

    result_value = nrf_gzll_enable();
    if (!result_value)
    {
        LOG_ERR("Cannot enable GZLL");
        return -EIO;
    }

    LOG_INF("GZLL device initialized");

    return 0;
}

/*
 * Convert debounced key state into radio reports.
 *
 * Previous-report tracking is updated only after the packet enters the Gazell
 * FIFO. If the FIFO is full, the same report remains pending and will be
 * retried by the next scan tick.
 */
static void wireless_submit_keymap_reports(void)
{
    int ret;

    keyboard_report_build_from_keymap();
    consumer_report[1] = knob_report_apply(consumer_report[1]);

    if (memcmp(keyboard_report_prev, keyboard_report,
               sizeof(keyboard_report_prev)) != 0)
    {
        ret = wireless_gzll_queue_payload(keyboard_report,
                                          KBD_HID_KEYBOARD_REPORT_BYTES);
        if (ret == 0)
        {
            memcpy(keyboard_report_prev, keyboard_report,
                   sizeof(keyboard_report_prev));
        }
    }

    if (memcmp(consumer_report_prev, consumer_report,
               sizeof(consumer_report_prev)) != 0)
    {
        ret = wireless_gzll_queue_payload(consumer_report,
                                          KBD_HID_CONSUMER_REPORT_BYTES);
        if (ret == 0)
        {
            memcpy(consumer_report_prev, consumer_report,
                   sizeof(consumer_report_prev));
            knob_report_sent(consumer_report[1]);
        }
    }
}

static int keyboard_submit_report(const struct device *hid_dev,
                                   struct usbd_context *sample_usbd,
                                   const uint8_t *report,
                                   size_t report_size,
                                   bool wake_on_press)
{
    int ret;

    if (!kb_ready)
    {
        return -EAGAIN;
    }

    /*
     * If the host suspended USB, only a key press should request remote wake.
     * Reports remain pending until USB resumes.
     */
    if (usbd_is_suspended(sample_usbd))
    {
        if (IS_ENABLED(CONFIG_SAMPLE_USBD_REMOTE_WAKEUP) && wake_on_press)
        {
            ret = usbd_wakeup_request(sample_usbd);
            if (ret)
            {
                LOG_ERR("Remote wakeup error, %d", ret);
            }
        }
        return -EAGAIN;
    }

    LOG_DBG("Main thread: USB report");

    ret = hid_device_submit_report(hid_dev, report_size, report);
    if (ret)
    {
        LOG_ERR("HID submit report error, %d", ret);
    }
    return ret;
}

static void keyboard_submit_keymap_reports(const struct device *hid_dev,
                                           struct usbd_context *sample_usbd)
{
    bool wake_on_press = false;
    int ret;

    keyboard_report_build_from_keymap();
    consumer_report[1] = knob_report_apply(consumer_report[1]);

    for (size_t i = 1; i < sizeof(keyboard_report); i++)
    {
        wake_on_press |= keyboard_report[i] != 0U;
    }

    /*
     * Submit only changed reports. Keyboard and consumer reports are tracked
     * separately, so a media-key change does not resend the full NKRO report.
     * Advance the sent snapshot only on success; retry on subsequent ticks.
     */
    if (memcmp(keyboard_report_prev, keyboard_report,
               sizeof(keyboard_report_prev)) != 0)
    {
        ret = keyboard_submit_report(hid_dev, sample_usbd,
                               keyboard_report,
                               KBD_HID_KEYBOARD_REPORT_BYTES,
                               wake_on_press);
        if (ret == 0)
        {
            memcpy(keyboard_report_prev, keyboard_report,
                   sizeof(keyboard_report_prev));
        }
    }

    if (memcmp(consumer_report_prev, consumer_report,
               sizeof(consumer_report_prev)) != 0)
    {
        ret = keyboard_submit_report(hid_dev, sample_usbd,
                               consumer_report,
                               KBD_HID_CONSUMER_REPORT_BYTES,
                               consumer_report[1] != 0U);
        if (ret == 0)
        {
            memcpy(consumer_report_prev, consumer_report,
                   sizeof(consumer_report_prev));
            knob_report_sent(consumer_report[1]);
        }
    }
}

static int mode_gpio_init_one(const struct gpio_dt_spec *gpio)
{
    if (!gpio_is_ready_dt(gpio))
    {
        LOG_ERR("Mode GPIO device %s is not ready", gpio->port->name);
        return -ENODEV;
    }

