BrianLChen/nRF52840-2.4GKeyboard/Keyboard_Body/src/main.c
    return gpio_pin_configure_dt(gpio, GPIO_INPUT);
}

static int mode_gpio_init(void)
{
    int ret;

    ret = mode_gpio_init_one(&mode_wire);
    if (ret != 0)
    {
        return ret;
    }

    ret = mode_gpio_init_one(&mode_ble);
    if (ret != 0)
    {
        return ret;
    }

    return mode_gpio_init_one(&mode_wireless);
}

/*
 * Read the external mode switch.
 *
 * This is currently not used by main() because wired mode is forced during
 * bring-up. It will become the mode selection point once the switch hardware
 * mapping is finalized.
 */
static enum keyboard_mode __maybe_unused keyboard_mode_detect(void)
{
    if (gpio_pin_get_dt(&mode_wire) > 0)
    {
        LOG_INF("Keyboard mode: wired");
        return KEYBOARD_MODE_WIRED;
    }

    if (gpio_pin_get_dt(&mode_ble) > 0)
    {
        LOG_INF("Keyboard mode: BLE");
        return KEYBOARD_MODE_BLE;
    }

    if (gpio_pin_get_dt(&mode_wireless) > 0)
    {
        LOG_INF("Keyboard mode: 2.4G");
        return KEYBOARD_MODE_WIRELESS_24G;
    }

    LOG_WRN("No mode switch active, defaulting to wired mode");
    return KEYBOARD_MODE_WIRED;
}

static int peripheral_init(void)
{
    int ret;

    ret = keyboard_leds_init();
    if (ret != 0)
    {
        return ret;
    }

    /* Restore the original board's MOS enable and startup settling time. */
    if (!gpio_is_ready_dt(&kbd_power))
    {
        LOG_ERR("Keyboard power GPIO is not ready");
        return -ENODEV;
    }
    ret = gpio_pin_configure_dt(&kbd_power, GPIO_OUTPUT_ACTIVE);
    if (ret != 0)
    {
        LOG_ERR("Failed to enable keyboard power, %d", ret);
        return ret;
    }
    k_msleep(100);

    /*
     * Shared initialization for wired, BLE, and 2.4G modes. Mode-specific USB
     * or radio setup happens later, but all modes need reports, keymap, SPI
     * matrix scan, debounce state, and the periodic scan timer.
     */
    keyboard_report_init();
    keymap_init();

    ret = knob_init();
    if (ret != 0)
    {
        LOG_ERR("Knob device is not ready, %d", ret);
        return ret;
    }

    ret = keyscan_init();
    if (ret != 0)
    {
        return ret;
    }

    k_timer_start(&scan_timer,
                  K_USEC(KBD_SCAN_PERIOD_US),
                  K_USEC(KBD_SCAN_PERIOD_US));

    return 0;
}

static int wireless_24g_mode_run(void)
{
    int ret;

    LOG_INF("2.4G mode init");

    ret = wireless_gzll_init();
    if (ret != 0)
    {
        return ret;
    }

    /*
     * The scan timer drives 2.4G reports the same way it drives wired USB
     * reports. Gazell callbacks only report TX status and ACK payloads.
     */
    while (true)
    {
        k_sem_take(&scan_sem, K_FOREVER);
        (void)keyboard_scan_once();
        wireless_submit_keymap_reports();
    }

    return 0;
}

static void ble_mode_dummy(void)
{
    LOG_INF("BLE mode dummy init");

    /*
     * BLE transport is intentionally empty for now. Keep scan/debounce running
     * here so the future BLE path can reuse the same key state pipeline.
     */
    while (true)
    {
        k_sem_take(&scan_sem, K_FOREVER);
        (void)keyboard_scan_once();
    }
}

static void kb_iface_ready(const struct device *dev, const bool ready)
{
    LOG_INF("HID device %s interface is %s",
            dev->name, ready ? "ready" : "not ready");
    kb_ready = ready;
}

static int kb_get_report(const struct device *dev,
                         const uint8_t type, const uint8_t id, const uint16_t len,
                         uint8_t *const buf)
{
    if (type != HID_REPORT_TYPE_OUTPUT)
    {
        LOG_WRN("Unsupported Get Report type %u ID %u", type, id);
        return -ENOTSUP;
    }

    if (id != 0U && id != KBD_HID_REPORT_ID_KEYBOARD)
    {
        LOG_WRN("Unsupported output report ID %u", id);
        return -ENOTSUP;
    }

    if (len == 0U)
    {
        return -EINVAL;
    }

    /*
     * Return the cached LED byte for control endpoint GET_REPORT. This mirrors
     * the last accepted SET_REPORT state.
     */
    buf[0] = keyboard_led_state;
    LOG_INF("Get keyboard LED state: 0x%02x", keyboard_led_state);

    return 1;
}

static int kb_set_report(const struct device *dev,
                         const uint8_t type, const uint8_t id, const uint16_t len,
                         const uint8_t *const buf)
{
    if (type != HID_REPORT_TYPE_OUTPUT)
    {
        LOG_WRN("Unsupported report type");
        return -ENOTSUP;
    }

    return keyboard_leds_set_report(id, len, buf);
}

/* Idle duration is stored but not used to calculate idle reports. */
static void kb_set_idle(const struct device *dev,
                        const uint8_t id, const uint32_t duration)
{
    LOG_INF("Set Idle %u to %u", id, duration);
    kb_duration = duration;
}

static uint32_t kb_get_idle(const struct device *dev, const uint8_t id)
{
    LOG_INF("Get Idle %u to %u", id, kb_duration);
    return kb_duration;
}

static void kb_set_protocol(const struct device *dev, const uint8_t proto)
{
    LOG_INF("Protocol changed to %s",
            proto == 0U ? "Boot Protocol" : "Report Protocol");
}

static void __maybe_unused kb_output_report(const struct device *dev,
                                            const uint16_t len,
                                            const uint8_t *const buf)
{
    LOG_HEXDUMP_INF(buf, len, "Output report");
    /*
     * This callback may receive either [led_state] or
     * [report_id, led_state]. Do not pass buf[0] as the report ID here:
     * for [led_state], CapsLock is 0x02 and Num+Caps is 0x03.
     */
    kb_set_report(dev, HID_REPORT_TYPE_OUTPUT, 0U, len, buf);
}

struct hid_device_ops kb_ops = {
    .iface_ready = kb_iface_ready,
    .get_report = kb_get_report,
    .set_report = kb_set_report,
    .set_idle = kb_set_idle,
    .get_idle = kb_get_idle,
    .set_protocol = kb_set_protocol,
    /*
     * Keep interrupt OUT disabled for now. LED output reports are handled
     * through control endpoint SET_REPORT to avoid the old delayed LED path.
     */
    .output_report = NULL,
};

