BrianLChen/nRF52840-2.4GKeyboard/Keyboard_Body/src/main.c
/*
 * USB device message callback.
 *
 * On boards with VBUS detection, USB is enabled/disabled with cable state.
 * On boards without VBUS detection, wired_mode_run() enables USB directly.
 */
static void msg_cb(struct usbd_context *const usbd_ctx,
                   const struct usbd_msg *const msg)
{
    LOG_INF("USBD message: %s", usbd_msg_type_string(msg->type));

    if (msg->type == USBD_MSG_CONFIGURATION)
    {
        LOG_INF("\tConfiguration value %d", msg->status);
    }

    if (usbd_can_detect_vbus(usbd_ctx))
    {
        if (msg->type == USBD_MSG_VBUS_READY)
        {
            if (usbd_enable(usbd_ctx))
            {
                LOG_ERR("Failed to enable device support");
            }
        }

        if (msg->type == USBD_MSG_VBUS_REMOVED)
        {
            if (usbd_disable(usbd_ctx))
            {
                LOG_ERR("Failed to disable device support");
            }
        }
    }
}

static int wired_mode_run(void)
{
    struct usbd_context *sample_usbd;
    const struct device *hid_dev;
    int ret;

    LOG_INF("Wired mode init");

    /*
     * Register one HID device that exposes both keyboard and consumer-control
     * reports through report IDs.
     */
    hid_dev = DEVICE_DT_GET_ONE(zephyr_hid_device);
    if (!device_is_ready(hid_dev))
    {
        LOG_ERR("HID Device is not ready");
        return -EIO;
    }

    ret = hid_device_register(hid_dev,
                              hid_report_desc, hid_report_desc_size,
                              &kb_ops);
    if (ret != 0)
    {
        LOG_ERR("Failed to register HID Device, %d", ret);
        return ret;
    }

    /*
     * Polling period is configured from kbd_define.h so product variants can
     * select 250/500/1000 Hz without touching USB setup code.
     */
    if (IS_ENABLED(CONFIG_USBD_HID_SET_POLLING_PERIOD))
    {
        ret = hid_device_set_in_polling(hid_dev,
                                        KBD_HID_REPORT_POLLING_PERIOD_US);
        if (ret)
        {
            LOG_WRN("Failed to set IN report polling period, %d", ret);
        }

        ret = hid_device_set_out_polling(hid_dev,
                                         KBD_HID_REPORT_POLLING_PERIOD_US);
        if (ret != 0 && ret != -ENOTSUP)
        {
            LOG_WRN("Failed to set OUT report polling period, %d", ret);
        }
    }

    sample_usbd = sample_usbd_init_device(msg_cb);
    if (sample_usbd == NULL)
    {
        LOG_ERR("Failed to initialize USB device");
        return -ENODEV;
    }

    if (!usbd_can_detect_vbus(sample_usbd))
    {
        ret = usbd_enable(sample_usbd);
        if (ret)
        {
            LOG_ERR("Failed to enable device support");
            return ret;
        }
    }

    LOG_INF("HID keyboard sample is initialized");

    /*
     * Wired main loop:
     *   1. wait for the scan timer
     *   2. scan SPI matrix and debounce
     *   3. merge knob pulses with matrix consumer state
     *   4. submit changed reports, retrying previously failed submissions
     */
    while (true)
    {
        k_sem_take(&scan_sem, K_FOREVER);
        (void)keyboard_scan_once();
        keyboard_submit_keymap_reports(hid_dev, sample_usbd);
    }

    return 0;
}

int main(void)
{
    enum keyboard_mode mode;
    int ret;

    /*
     * Main thread owns scan/debounce/report work, so it runs above the RGB
     * thread. The scan timer only wakes this thread; it does not do SPI work.
     */
    k_thread_priority_set(k_current_get(), KBD_MAIN_THREAD_PRIORITY);

    ret = mode_gpio_init();
    if (ret != 0)
    {
        return ret;
    }

    /* Force wired mode until the mode switch hardware is ready. */
    mode = KEYBOARD_MODE_WIRED;

    ret = peripheral_init();
    if (ret != 0)
    {
        return ret;
    }

    /*
     * Common peripherals are ready before entering the selected transport
     * loop. Each mode function owns its transport-specific initialization and
     * then stays in its own forever loop.
     */
    switch (mode)
    {
    case KEYBOARD_MODE_WIRELESS_24G:
        return wireless_24g_mode_run();
    case KEYBOARD_MODE_BLE:
        ble_mode_dummy();
        break;
    case KEYBOARD_MODE_WIRED:
    default:
        return wired_mode_run();
    }

    return 0;
}
